{
  "irVersion": "7",
  "producerName": "tf2onnx",
  "producerVersion": "1.8.4",
  "graph": {
    "node": [
      {
        "input": [
          "lstm_2_input:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/Shape:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/Shape",
        "opType": "Shape"
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/Shape:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/Shape__11:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/Shape__11",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/Shape__11:0",
          "const_axes__38",
          "const_ends__13",
          "const_axes__38"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/strided_slice:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/strided_slice",
        "opType": "Slice",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/strided_slice:0",
          "const_fold_opt__58"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros/packed_Concat__27:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/zeros/packed_Concat__27",
        "opType": "Concat",
        "attribute": [
          {
            "name": "axis",
            "i": "0",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros/packed_Concat__27:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros__28:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/zeros__28",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "7",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "const_fold_opt__99",
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros__28:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros_1:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/zeros_1",
        "opType": "Expand"
      },
      {
        "input": [
          "lstm_2_input:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/transpose:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/transpose",
        "opType": "Transpose",
        "attribute": [
          {
            "name": "perm",
            "ints": [
              "1",
              "0",
              "2"
            ],
            "type": "INTS"
          }
        ]
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/transpose:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape",
        "opType": "Shape"
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape__29:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape__29",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "6",
            "type": "INT"
          }
        ]
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/Shape__29:0",
          "const_axes__38",
          "const_ends__13",
          "const_axes__38"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice",
        "opType": "Slice",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice:0",
          "const_axes__38"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice__33:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice__33",
        "opType": "Squeeze",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice__33:0"
        ],
        "output": [
          "__inference_while_cond_2503822_352_while/Less__6:0"
        ],
        "name": "__inference_while_cond_2503822_352_while/Less__6",
        "opType": "Cast",
        "attribute": [
          {
            "name": "to",
            "i": "1",
            "type": "INT"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "const_fold_opt__99",
          "__inference_while_cond_2503822_352_while/Less__6:0"
        ],
        "output": [
          "__inference_while_cond_2503822_352_while/Less:0"
        ],
        "name": "__inference_while_cond_2503822_352_while/Less",
        "opType": "Less",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while/maximum_iterations:0",
          "__inference_while_cond_2503822_352_while/Less:0",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/time:0",
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros_1:0",
          "StatefulPartitionedCall/sequential_2/lstm_2/zeros_1:0",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice__33:0",
          "Func/StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/input/_11:0",
          "Func/StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/input/_12:0",
          "Func/StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/input/_13:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:0",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:1",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:2",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:3",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:4",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:5",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:6",
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:7"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop",
        "opType": "Loop",
        "attribute": [
          {
            "name": "body",
            "g": {
              "node": [
                {
                  "input": [
                    "while_placeholder:0",
                    "while/add_2/y:0"
                  ],
                  "output": [
                    "while/Identity_2:0"
                  ],
                  "name": "while/add_2",
                  "opType": "Add"
                },
                {
                  "input": [
                    "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/transpose:0",
                    "while_placeholder:0"
                  ],
                  "output": [
                    "while/TensorArrayV2Read/TensorListGetItem:0"
                  ],
                  "name": "while/TensorArrayV2Read/TensorListGetItem",
                  "opType": "Gather"
                },
                {
                  "input": [
                    "while_placeholder_2:0",
                    "while_matmul_1_recurrent_kernel_0:0"
                  ],
                  "output": [
                    "while/MatMul_1:0"
                  ],
                  "name": "while/MatMul_1",
                  "opType": "MatMul"
                },
                {
                  "input": [
                    "while/TensorArrayV2Read/TensorListGetItem:0",
                    "while_matmul_kernel_0:0"
                  ],
                  "output": [
                    "while/MatMul:0"
                  ],
                  "name": "while/MatMul",
                  "opType": "MatMul"
                },
                {
                  "input": [
                    "while/MatMul:0",
                    "while/MatMul_1:0"
                  ],
                  "output": [
                    "while/add:0"
                  ],
                  "name": "while/add",
                  "opType": "Add"
                },
                {
                  "input": [
                    "while/add:0",
                    "while_biasadd_bias_0:0"
                  ],
                  "output": [
                    "while/BiasAdd:0"
                  ],
                  "name": "while/BiasAdd",
                  "opType": "Add"
                },
                {
                  "input": [
                    "while/BiasAdd:0"
                  ],
                  "output": [
                    "while/split:0",
                    "while/split:1",
                    "while/split:2",
                    "while/split:3"
                  ],
                  "name": "while/split",
                  "opType": "Split",
                  "attribute": [
                    {
                      "name": "axis",
                      "i": "1",
                      "type": "INT"
                    }
                  ]
                },
                {
                  "input": [
                    "while/split:2"
                  ],
                  "output": [
                    "while/Tanh:0"
                  ],
                  "name": "while/Tanh",
                  "opType": "Tanh"
                },
                {
                  "input": [
                    "while/split:3"
                  ],
                  "output": [
                    "while/Sigmoid_2:0"
                  ],
                  "name": "while/Sigmoid_2",
                  "opType": "Sigmoid"
                },
                {
                  "input": [
                    "while/split:1"
                  ],
                  "output": [
                    "while/Sigmoid_1:0"
                  ],
                  "name": "while/Sigmoid_1",
                  "opType": "Sigmoid"
                },
                {
                  "input": [
                    "while/Sigmoid_1:0",
                    "while_placeholder_3:0"
                  ],
                  "output": [
                    "while/mul:0"
                  ],
                  "name": "while/mul",
                  "opType": "Mul"
                },
                {
                  "input": [
                    "while/split:0"
                  ],
                  "output": [
                    "while/Sigmoid:0"
                  ],
                  "name": "while/Sigmoid",
                  "opType": "Sigmoid"
                },
                {
                  "input": [
                    "while/Sigmoid:0",
                    "while/Tanh:0"
                  ],
                  "output": [
                    "while/mul_1:0"
                  ],
                  "name": "while/mul_1",
                  "opType": "Mul"
                },
                {
                  "input": [
                    "while/mul:0",
                    "while/mul_1:0"
                  ],
                  "output": [
                    "while/Identity_5:0"
                  ],
                  "name": "while/add_1",
                  "opType": "Add"
                },
                {
                  "input": [
                    "while/Identity_5:0"
                  ],
                  "output": [
                    "while/Tanh_1:0"
                  ],
                  "name": "while/Tanh_1",
                  "opType": "Tanh"
                },
                {
                  "input": [
                    "while/Sigmoid_2:0",
                    "while/Tanh_1:0"
                  ],
                  "output": [
                    "while/Identity_4:0"
                  ],
                  "name": "while/mul_2",
                  "opType": "Mul"
                },
                {
                  "input": [
                    "while/Identity_4:0"
                  ],
                  "output": [
                    "while/TensorArrayV2Write/TensorListSetItem:0"
                  ],
                  "name": "while/TensorArrayV2Write/TensorListSetItem",
                  "opType": "Identity"
                },
                {
                  "input": [
                    "while_strided_slice_0:0"
                  ],
                  "output": [
                    "cond___while/Less__6:0"
                  ],
                  "name": "cond___while/Less__6",
                  "opType": "Cast",
                  "attribute": [
                    {
                      "name": "to",
                      "i": "1",
                      "type": "INT"
                    }
                  ],
                  "domain": ""
                },
                {
                  "input": [
                    "while/Identity_2:0"
                  ],
                  "output": [
                    "cond___while/Less__5:0"
                  ],
                  "name": "cond___while/Less__5",
                  "opType": "Cast",
                  "attribute": [
                    {
                      "name": "to",
                      "i": "1",
                      "type": "INT"
                    }
                  ],
                  "domain": ""
                },
                {
                  "input": [
                    "cond___while/Less__5:0",
                    "cond___while/Less__6:0"
                  ],
                  "output": [
                    "cond___while/Identity:0"
                  ],
                  "name": "cond___while/Less",
                  "opType": "Less",
                  "domain": ""
                }
              ],
              "name": "__inference_while_body_2503823_5467",
              "initializer": [
                {
                  "dataType": 6,
                  "name": "while/add_2/y:0",
                  "rawData": "AQAAAA=="
                }
              ],
              "docString": "graph for StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop body",
              "input": [
                {
                  "name": "while_while_loop_counter:0",
                  "type": {
                    "tensorType": {
                      "elemType": 7,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "cond__35:0",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while_placeholder:0",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while_placeholder_2:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimParam": "unk__170"
                          },
                          {
                            "dimValue": "100"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_placeholder_3:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimParam": "unk__171"
                          },
                          {
                            "dimValue": "100"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_strided_slice_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while_matmul_kernel_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "1"
                          },
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_matmul_1_recurrent_kernel_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "100"
                          },
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_biasadd_bias_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                }
              ],
              "output": [
                {
                  "name": "cond___while/Identity:0",
                  "type": {
                    "tensorType": {
                      "elemType": 9,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while/Identity_2:0",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while/Identity_4:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimParam": "unk__172"
                          },
                          {
                            "dimValue": "100"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while/Identity_5:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimParam": "unk__173"
                          },
                          {
                            "dimValue": "100"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_strided_slice_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 6,
                      "shape": {}
                    }
                  }
                },
                {
                  "name": "while_matmul_kernel_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "1"
                          },
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_matmul_1_recurrent_kernel_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "100"
                          },
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while_biasadd_bias_0:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimValue": "400"
                          }
                        ]
                      }
                    }
                  }
                },
                {
                  "name": "while/TensorArrayV2Write/TensorListSetItem:0",
                  "type": {
                    "tensorType": {
                      "elemType": 1,
                      "shape": {
                        "dim": [
                          {
                            "dimParam": "unk__174"
                          },
                          {
                            "dimValue": "100"
                          }
                        ]
                      }
                    }
                  }
                }
              ]
            },
            "type": "GRAPH"
          }
        ],
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while_loop:7",
          "const_starts__36",
          "const_ends__37",
          "const_axes__38"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2",
        "opType": "Slice",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2:0",
          "const_axes__38"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2__39:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2__39",
        "opType": "Squeeze",
        "domain": ""
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/strided_slice_2__39:0",
          "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp:0"
        ],
        "output": [
          "StatefulPartitionedCall/sequential_2/dense_2/MatMul:0"
        ],
        "name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul",
        "opType": "MatMul"
      },
      {
        "input": [
          "StatefulPartitionedCall/sequential_2/dense_2/MatMul:0",
          "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp:0"
        ],
        "output": [
          "dense_2"
        ],
        "name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd",
        "opType": "Add"
      }
    ],
    "name": "tf2onnx",
    "initializer": [
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "const_starts__36",
        "rawData": "//////////8="
      },
      {
        "dataType": 1,
        "name": "const_fold_opt__99",
        "rawData": "AAAAAA=="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 6,
        "name": "const_fold_opt__58",
        "rawData": "ZAAAAA=="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "const_ends__37",
        "rawData": "////fwAAAAA="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "const_ends__13",
        "rawData": "AQAAAAAAAAA="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 7,
        "name": "const_axes__38",
        "rawData": "AAAAAAAAAAA="
      },
      {
        "dataType": 7,
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/while/maximum_iterations:0",
        "rawData": "/////////38="
      },
      {
        "dataType": 6,
        "name": "StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/time:0",
        "rawData": "AAAAAA=="
      },
      {
        "dims": [
          "100",
          "1"
        ],
        "dataType": 1,
        "name": "StatefulPartitionedCall/sequential_2/dense_2/MatMul/ReadVariableOp:0",
        "rawData": "9vZGPiE3br6Khaq9234kvsu1BD4FXh68uaHovfIiW71yV2+9tuFmPnAP5z28FN69Foosvh9iuzwp14i+7r1ZPgzCoL1TgFM+jhc8PvysHT5/eDM9D+wIPpEYWr596zS+ccwXPrp+1z3l41m+CU/kPQMQ9T125z49UTo0vidXyTzLyB8+zAuoPVLdPz6Q9u69b8EQvoeIKT78Ej0+VtxKvlteMb5FCAw+JG6KvCVNLr2qfk0+rqYCPViIGD59PSy+yM+XOyRjgr7i3YM+VxLIPPqLI72hVAC+B20hvVqNX74repq9XVNKPTMNbj4qjfs9v3ZHvmIxCzzeNlc+txKLPSGatj3zETS9SAsmvqvvvb3xUEI9HH/YvUTGED7YE9A9DjZ4PcBOFL5WtCS+br5UPuzYS76FLMi9agyMPbA9Sr4F7xA8gsDbvevHWT4pPia+QNRnPiHseL4UtIa9lWBlPUqHLL0SBnM+9alEvqL1Aj5SNVC+P1GLPK12tDzaN1O+Lpd+PK9LAz6Xx1o9jRBdvA=="
      },
      {
        "dims": [
          "1"
        ],
        "dataType": 1,
        "name": "StatefulPartitionedCall/sequential_2/dense_2/BiasAdd/ReadVariableOp:0",
        "rawData": "I4OLOw=="
      },
      {
        "dims": [
          "400"
        ],
        "dataType": 1,
        "name": "Func/StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/input/_13:0",
        "rawData": "aYEiPbnQpDwKLLy8sutavEzgiTxFnnc8V9SAPNCPL7w5B9M8ipg2vMLPZT0Tg9y7/dspOuNyIrwqCME8shw1PAdMVLwEr5u8JqZpvEjMyD20YWq7S+fJO8UMxDxYESo8QnTrO83F8jyt+WI89iUBvD+lGD2pL6G7KcdvPeUMqDsQS407M+4tPB1X+TzrGVw8J3eQPHcj9zrxNIW8jOZZOmUiAD0wQGG6Z4R4vONdDrvu5OK7UHxyPJFeLjtmyG682dWAvIGaET3xA9c87D5cPHU2ILsM7Io8VeJOvOMDg7y5dRk9tpasu1H+DzxZtz28RljnPNwgBTr4PZa8zTtTPF7e1LsHV5U7qUExO1+1WTy0gJU75aawPMIFAz11B8s8prsjvFRl1jwoGeA7j/CJvIW7jrzTRvk8XUKmu2C5dzzYrXM7wGMvPEOb5jyPzkW8NcupPB5AmTyOTxA7IO0sPB/D+Lrbyzo8pedGPIQgXjwBH668DwTVOwVDVbyzjCW89b7bPEjlILtKJDq8mIeKPI+bgT9pIoE/80l7P7XefD+yoIA/1KOAPzuogD+WE3w/h5V/P+A+fD9/KIE/x8B+P1TpfD96sXw/YFaBP7AmgD/VZXw/CO17P4JSfj8SQ4E/rpF9P8c6gD/AtYE/hl+AP2gNgD+St38/30SAP0pPfT+BOn8/xN18P/jngT/U2n8/lFJ+P1g+fD/aooA/v1CAP/P0gD+nzX0/B8h7P80bfj9y5YE/dkZ9PzZQfD+EX38/XSt9P7jXgD8ti34/ToF8PwssfD+Bu4E/iDOBP9BMgD+nnX4/i+SAP3eofD+8h3w/T65+P9q4fT96WoA/uOV8P4qZgT8E2Hw/6tt7P8DMgD9TInw/NBKAP/v7fz978oA/muF/P9j6gD+kAYI/p1iBP9X4fD/kO4E/SdZ/P7RPfD/+KHw/eu+APw0afD95GYA/bbx+P0KOgD+i9YA/Id57P77CgD/8rYA/7Wp9PwREgD+0jX0/NVSAP4RAgD8sxYA/9i97P7S8fj8mu3w/VfV8PxUHgD+bo3w/NuR8P9AmgD+vqro6T2TMugrsJ7y2uMe7Jlm+uMB5yrq5XnM54KhWu9vFizuOJcE7vcklu/tvnrsCWWi7bKjROwpR9LpRK5c6aOdsu0V1sTvasLs7fT+Pu15X4zvOpr06jtgVu/UKpLpYwhU6i1h1u82U0bphWJg7v3jeOlmMDbtmHba5L36GO/oq2jo2V7069BaYuQwrZrlesWy6NjE2O8vxUTv502e7+SH4ugvHqDq6Eqq7G90Iu6oMUzv09ao5+hdAOnukX7vaAam5NksVuxC3OTp6VmW6f8+au+dkFjrTi9C6QEfEu+i/1DuR0FE7rYXKOtvvXTsAwOa64ciXO9YkUDuiByC55rOCO/agcrqy8tK6kr4kuqABgjtcnkg5GOq7OkwQezrgPQk7rmjpumn0XLrJp2M7PAKhuydIyTp53F+7dckzugCx+jpUW0K37H9XOoVxxrupzLM6J0EXu4muxDtBF627SVjCu8SCjTp2bDW7cm+oOnTFHbuJq7s7qh+IO2b1MLseAfQ5qBaZOxK40blDzUu6BRUiPb+OpDwb8ru8DLxbvLBzhzwsUHU8WzR9PDdyMLxC1dI8rVQ2vOFGYj32tN670aSPOhF5ILzd2r88OmQ1PKipVLwJ1Ju8lA9pvCZ1yD1Xll+7mfTIO4ATwzzCMCw8IfDgOyN38zzOamI8axsDvE4TGj01Hpu7q7puPXcCpDv0gIs7cgMbPGAg+DzNdV08kiyPPPouDTt7noW8Q3YDOlQw/zy924i64SJ5vBQTDbtDX+G7Em1yPPU7LTsPHW683fSAvP98ET1Oo9Y8yBFbPE7zGbv8pIs8R0VPvD2NgrzjnBk9gdaru2TOETygvUG8flXlPBHc9DlfaJW8LxVVPLl917uffZU7ZnUrO6r7WTy9/5Q79rOxPANcAj1D1ss8geckvGUU1Tw4OeQ7XLmJvGAGj7wdaPo8/qWlu1PBeDz88nM7+qAtPI3q5TwKJUW8tMaoPND0lTx6mww7Gxc0PLZf+Lqe6zw8fwpIPL4gWzxhMq28HvHRO62kVbyTcCS8HgXcPBoIFLsmrTm8ypuKPA=="
      },
      {
        "dims": [
          "100",
          "400"
        ],
        "dataType": 1,
        "name": "Func/StatefulPartitionedCall/sequential_2/lstm_2/PartitionedCall/input/_12:0",
        "rawData": 